ofcases/step/final/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
//     div(phi,U)      Gauss limitedLinearV 1;
//     div(phi,k)      Gauss limitedLinear 1;
//     div(phi,epsilon) Gauss limitedLinear 1;
//     div(phi,omega)  Gauss limitedLinear 1;
//     div(phi,R)      Gauss limitedLinear 1;
//     div(R)          Gauss linear;
//     div(phi,nuTilda) Gauss limitedLinear 1;
//     div((nuEff*dev2(T(grad(U))))) Gauss linear;
    
    div(phi,U)      bounded Gauss LUST grad(U);

    turbulence      bounded Gauss limitedLinear 1;
    div(phi,k)      $turbulence;
    div(phi,epsilon) $turbulence;
    div(phi,omega)  $turbulence;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
